# Використовуємо легкий образ Node.js 18 на базі Alpine Linux 
FROM node:18-alpine

# Встановлюємо робочу папку всередині контейнера 
WORKDIR /app

# Копіюємо файли зі списком залежностей (package.json та package-lock.json) 
COPY package*.json ./

# Запускаємо встановлення бібліотек, необхідних для проєкту 
RUN npm install

# Копіюємо решту вихідного коду додатка в контейнер 
COPY . .

# Вказуємо порт 3000, на якому працюватиме сервер 
EXPOSE 3000

# Команда для запуску сервера при старті контейнера 
CMD ["node", "server.js"]
